yellow-new/ThreePhase_VSG/3.Software/F280049_ThreePhase_VSG/device/driverlib/inc/hw_fsi.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_EVT_FRC register
//
//*************************************************************************************************
#define FSI_RX_EVT_FRC_PING_WD_TO      0x1U     // Ping Watchdog Timeout Flag Force
#define FSI_RX_EVT_FRC_FRAME_WD_TO     0x2U     // Frame Watchdog Timeout Flag Force
#define FSI_RX_EVT_FRC_CRC_ERR         0x4U     // CRC Error Flag Force
#define FSI_RX_EVT_FRC_TYPE_ERR        0x8U     // Frame Type Error Flag Force
#define FSI_RX_EVT_FRC_EOF_ERR         0x10U    // End-of-Frame Error Flag Force
#define FSI_RX_EVT_FRC_BUF_OVERRUN     0x20U    // Receive Buffer Overrun Flag Force
#define FSI_RX_EVT_FRC_FRAME_DONE      0x40U    // Frame Done Flag Force
#define FSI_RX_EVT_FRC_BUF_UNDERRUN    0x80U    // Receive Buffer Underrun Flag Force
#define FSI_RX_EVT_FRC_ERR_FRAME       0x100U   // Error Frame Received Flag Force
#define FSI_RX_EVT_FRC_PING_FRAME      0x200U   // Ping Frame Received Flag Force
#define FSI_RX_EVT_FRC_FRAME_OVERRUN   0x400U   // Frame Overrun Flag Force
#define FSI_RX_EVT_FRC_DATA_FRAME      0x800U   // Data Frame Received Flag Force

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_BUF_PTR_LOAD register
//
//*************************************************************************************************
#define FSI_RX_BUF_PTR_LOAD_BUF_PTR_LOAD_S   0U
#define FSI_RX_BUF_PTR_LOAD_BUF_PTR_LOAD_M   0xFU   // Load value for receive buffer pointer

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_BUF_PTR_STS register
//
//*************************************************************************************************
#define FSI_RX_BUF_PTR_STS_CURR_BUF_PTR_S    0U
#define FSI_RX_BUF_PTR_STS_CURR_BUF_PTR_M    0xFU      // Current Buffer Pointer Index
#define FSI_RX_BUF_PTR_STS_CURR_WORD_CNT_S   8U
#define FSI_RX_BUF_PTR_STS_CURR_WORD_CNT_M   0x1F00U   // Available Words in Buffer

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_FRAME_WD_CTRL register
//
//*************************************************************************************************
#define FSI_RX_FRAME_WD_CTRL_FRAME_WD_CNT_RST   0x1U   // Frame Watchdog Counter Reset
#define FSI_RX_FRAME_WD_CTRL_FRAME_WD_EN        0x2U   // Frame Watchdog Counter Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_PING_WD_CTRL register
//
//*************************************************************************************************
#define FSI_RX_PING_WD_CTRL_PING_WD_RST   0x1U   // Ping Watchdog Counter Reset
#define FSI_RX_PING_WD_CTRL_PING_WD_EN    0x2U   // Ping Watchdog Counter Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_PING_TAG register
//
//*************************************************************************************************
#define FSI_RX_PING_TAG_PING_TAG_S   1U
#define FSI_RX_PING_TAG_PING_TAG_M   0x1EU   // Ping Frame Tag

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_INT1_CTRL register
//
//*************************************************************************************************
#define FSI_RX_INT1_CTRL_INT1_EN_PING_WD_TO      0x1U     // Enable Ping Watchdog Timeout Interrupt
                                                          // to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_FRAME_WD_TO     0x2U     // Enable Frame Watchdog Timeout
                                                          // Interrupt to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_CRC_ERR         0x4U     // Enable CRC Error Interrupt to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_TYPE_ERR        0x8U     // Enable Frame Type Error Interrupt to
                                                          // INT1
#define FSI_RX_INT1_CTRL_INT1_EN_EOF_ERR         0x10U    // Enable End-of-Frame Error Interrupt to
                                                          // INT1
#define FSI_RX_INT1_CTRL_INT1_EN_OVERRUN         0x20U    // Enable Receive Buffer Overrun
                                                          // Interrupt to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_FRAME_DONE      0x40U    // Enable Frame Done Interrupt to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_UNDERRUN        0x80U    // Enable Buffer Underrun Interrupt to
                                                          // INT1
#define FSI_RX_INT1_CTRL_INT1_EN_ERR_FRAME       0x100U   // Enable Error Frame Received Interrupt
                                                          // to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_PING_FRAME      0x200U   // Enable Ping Frame Received Interrupt
                                                          // to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_FRAME_OVERRUN   0x400U   // Enable Frame Overrun Interrupt to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_DATA_FRAME      0x800U   // Enable Data Frame Received Interrupt
                                                          // to INT1

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_INT2_CTRL register
//
//*************************************************************************************************
#define FSI_RX_INT2_CTRL_INT2_EN_PING_WD_TO      0x1U     // Enable Ping Watchdog Timeout Interrupt
                                                          // to INT2
#define FSI_RX_INT2_CTRL_INT2_EN_FRAME_WD_TO     0x2U     // Enable Frame Watchdog Timeout
                                                          // Interrupt to INT2
#define FSI_RX_INT2_CTRL_INT2_EN_CRC_ERR         0x4U     // Enable CRC Errror Interrupt to INT2
#define FSI_RX_INT2_CTRL_INT2_EN_TYPE_ERR        0x8U     // Enable Frame Type Error Interrupt to
                                                          // INT2
#define FSI_RX_INT2_CTRL_INT2_EN_EOF_ERR         0x10U    // Enable End-of-Frame Error Interrupt to
                                                          // INT2
#define FSI_RX_INT2_CTRL_INT2_EN_OVERRUN         0x20U    // Enable Buffer Overrun Interrupt to
                                                          // INT2
#define FSI_RX_INT2_CTRL_INT2_EN_FRAME_DONE      0x40U    // Enable Frame Done Interrupt to INT2
#define FSI_RX_INT2_CTRL_INT2_EN_UNDERRUN        0x80U    // Enable Buffer Underrun Interrupt to
                                                          // INT2
#define FSI_RX_INT2_CTRL_INT2_EN_ERR_FRAME       0x100U   // Enable Error Frame Received Interrupt
                                                          // to INT2
#define FSI_RX_INT2_CTRL_INT2_EN_PING_FRAME      0x200U   // Enable Ping Frame Received Interrupt
                                                          // to INT2
#define FSI_RX_INT2_CTRL_INT2_EN_FRAME_OVERRUN   0x400U   // Enable Frame Overrun Interrupt to INT2
#define FSI_RX_INT2_CTRL_INT2_EN_DATA_FRAME      0x800U   // Enable Data Frame Received Interrupt
                                                          // to INT2

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_LOCK_CTRL register
//
//*************************************************************************************************
#define FSI_RX_LOCK_CTRL_LOCK    0x1U      // Control Register Lock Enable
#define FSI_RX_LOCK_CTRL_KEY_S   8U
#define FSI_RX_LOCK_CTRL_KEY_M   0xFF00U   // Write Key

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_ECC_DATA register
//
//*************************************************************************************************
#define FSI_RX_ECC_DATA_DATA_LOW_S    0U
#define FSI_RX_ECC_DATA_DATA_LOW_M    0xFFFFU       // ECC Data Lower 16 Bits
#define FSI_RX_ECC_DATA_DATA_HIGH_S   16U
#define FSI_RX_ECC_DATA_DATA_HIGH_M   0xFFFF0000U   // ECC Data Upper 16 Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_ECC_VAL register
//
//*************************************************************************************************
#define FSI_RX_ECC_VAL_ECC_VAL_S   0U
#define FSI_RX_ECC_VAL_ECC_VAL_M   0x7FU   // Computed ECC Value

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_ECC_LOG register
//
//*************************************************************************************************
#define FSI_RX_ECC_LOG_SBE   0x1U   // Single Bit Error Detected
#define FSI_RX_ECC_LOG_MBE   0x2U   // Multiple Bit Errors Detected

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_DLYLINE_CTRL register
//
//*************************************************************************************************
#define FSI_RX_DLYLINE_CTRL_RXCLK_DLY_S   0U
#define FSI_RX_DLYLINE_CTRL_RXCLK_DLY_M   0x1FU     // Delay Line Tap Select for RXCLK
#define FSI_RX_DLYLINE_CTRL_RXD0_DLY_S    5U
#define FSI_RX_DLYLINE_CTRL_RXD0_DLY_M    0x3E0U    // Delay Line Tap Select for RXD0
#define FSI_RX_DLYLINE_CTRL_RXD1_DLY_S    10U
#define FSI_RX_DLYLINE_CTRL_RXD1_DLY_M    0x7C00U   // Delay Line Tap Select for RXD1

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_VIS_1 register
//
//*************************************************************************************************
#define FSI_RX_VIS_1_RX_CORE_STS   0x8U   // Receiver Core Status



#endif
